# MongoDB settings
HOST = 'mongodb://127.0.0.1'
PORT = 27017

# File Database
FILE_PATH = 'database/olo.csv'
FILE_ENCODING = 'UTF-8'
HEADER = True
DELIMITER = '\t'
DATA_INDEXES = [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18]

# Database settings
DATABASE = 'olo'
COLLECTION_NAME = 'collection_'
COLLECTION_SIZE = 500000
INSERT_COUNT = 100000

# Filter Address
FILTER_ADDRESSES = {
    'респ.': ['республика'],
    'обл.': ['область'],
    'г.': ['г', 'город', 'гор'],
    'с.': ['село'],
    'д.': ['дом', 'деревня'],
    'п.': ['посёлок', 'поселение'],
    'рп.': ['рабочий посёлок'],
    'р-н': ['район'],
    'ш.': ['шоссе'],
    'ул.': ['улица'],
    'к.': ['корпус'],
    'стр.': ['строение'],
    'кв.': ['квартира'],
    'наб.': ['набережная'],
    'пр-кт': ['проспект'],
    'пр-д': ['проезд'],
    'б.': ['бульвар'],
    'пл.': ['площадь'],
    'пер.': ['переулок']
}

FILTER_SEX = {
    0: [0, 'ж', 'f', 'female', 'женский', 'женщина'],
    1: [1, 'м', 'm', 'male', 'мужской', 'мужчина']
}